Revit 2027 API
ParameterTypeId.StairsRunStructural Property
 "Structural": Structural
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunStructural { get; }
Public Shared ReadOnly Property StairsRunStructural As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunStructural {
	ForgeTypeId^ get ();
}
static member StairsRunStructural : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace